cases/subsonic/Zhang/We3500/b_6Dinj/setup/constant/radiationProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      radiationProperties;
}

radiation       off;
radiationModel  none;

// ************************************************************************* //
