cases/subsonic/Zhang/We3500/b_6Dinj/setup/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Pressione statica assoluta [Pa]
// Compatibile con sprayFoam (rhoThermo comprimibile)
//
// FIX: outletTop e outletRight da fixedValue a totalPressure
//      per replicare il "pressure outlet" di Fluent (Zhang et al.),
//      che usa p_totale durante il backflow, limitando naturalmente
//      la velocità di rientro.  Con fixedValue la pressione statica
//      costante genera un gradiente artificiale che guida backflow
//      troppo forte (Ux negativo anomalo sulla fascia superiore).

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    gasInlet
    {
        type            zeroGradient;
    }

    outletRight
    {
        type            totalPressure;
        rho             rho;
        psi             thermo:psi;
        gamma           1.4;
        p0              uniform 101325;
        value           uniform 101325;
    }

    outletTop
    {
        type            totalPressure;
        rho             rho;
        psi             thermo:psi;
        gamma           1.4;
        p0              uniform 101325;
        value           uniform 101325;
    }

    bottomWall
    {
        type            fixedFluxPressure;
        value           uniform 101325;
    }

    filmTopWall
    {
        type            fixedFluxPressure;
        value           uniform 101325;
    }

    stepWall
    {
        type            fixedFluxPressure;
        value           uniform 101325;
    }

    front
    {
        type            symmetryPlane;
    }

    back
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //
