cases/subsonic/Zhang/We3500/b_6Dinj/setup/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// nut = Cmu * k / omega = 0.09 * 14.6 / 7800 ≈ 1.69e-4 m^2/s

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1.69e-4;

boundaryField
{
    gasInlet
    {
        type            calculated;
        value           uniform 1.69e-4;
    }

    outletRight
    {
        type            calculated;
        value           uniform 1.69e-4;
    }

    outletTop
    {
        type            calculated;
        value           uniform 1.69e-4;
    }

    bottomWall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    filmTopWall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    stepWall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    front
    {
        type            symmetryPlane;
    }

    back
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //
